In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data = {
    "Name" : ["Daniel", "Moses", "Theo", "Marry"],
    "Age":[18, 21, 30, 74],
    "Score" : [18, 76, 54, 30]
}

In [3]:
df = pd.DataFrame(data)
df

     Name  Age  Score
0  Daniel   18     18
1   Moses   21     76
2    Theo   30     54
3   Marry   74     30

In [6]:
df.head()

     Name  Age  Score
0  Daniel   18     18
1   Moses   21     76
2    Theo   30     54
3   Marry   74     30

In [7]:
df.tail()

     Name  Age  Score
0  Daniel   18     18
1   Moses   21     76
2    Theo   30     54
3   Marry   74     30

In [8]:
df.shape #number of rows and columns  #its a property, not a method , so no parentheses

(4, 3)

In [9]:
df.columns #column names

Index(['Name', 'Age', 'Score'], dtype='object')

In [10]:
df.info() #data types and nulls

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Score   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [12]:
df.describe() #statistics overview

             Age      Score
count   4.000000   4.000000
mean   35.750000  44.500000
std    26.004807  25.787594
min    18.000000  18.000000
25%    20.250000  27.000000
50%    25.500000  42.000000
75%    41.000000  59.500000
max    74.000000  76.000000

In [13]:
df["Name"]

0    Daniel
1     Moses
2      Theo
3     Marry
Name: Name, dtype: object

In [15]:
df[["Name", "Score"]] #Selecting items by Columns

     Name  Score
0  Daniel     18
1   Moses     76
2    Theo     54
3   Marry     30

In [16]:
df.loc[1]   # to access rows by index

Name     Moses
Age         21
Score       76
Name: 1, dtype: object

In [ ]:
#Students whose Score is greater than 60
df[df["Score"] > 60]

In [17]:
#Multiple Conditions
df[(df["Age"] > 20) & (df["Score"] >= 50)]

    Name  Age  Score
1  Moses   21     76
2   Theo   30     54